---
kind: type
id: T:Autodesk.Revit.DB.IConnector
source: html/d5c02879-947d-d177-9c9a-52f662371da7.htm
---
# Autodesk.Revit.DB.IConnector

An interface which provides access to connector in Autodesk Revit MEP document.

## Syntax (C#)
```csharp
public interface IConnector
```

## Remarks
This interface is shared by Connector ,
 ConnectorElement .